#+title: CPP
*** an example of a user defined function
#+BEGIN_SRC cpp
returnType functionName() {
    // This is the function body
}
#+END_SRC
+ the first line is informally called the =function header=
#+BEGIN_SRC cpp
#include <iostream> // for std::cout

// definition of user-defined function doPrint()
void doPrint() {
    std::cout << "In doPrint()\n";
}

// definition of function main()
int main() {
    std::cout << "Starting main()\n";
    doPrint(); // Interrupt main() by making a function call to doPrint()
    std::cout << "Ending main()\n";

    return 0;
}
#+END_SRC
#+RESULTS:
: Starting main()
: In doPrint()
: Ending main()
*** calling functions more than once
#+BEGIN_SRC cpp
#include <iostream> // for std::cout

// definition of user-defined function doPrint()
void doPrint() {
    std::cout << "In doPrint()\n";
}

// definition of function main()
int main() {
    std::cout << "Starting main()\n";
    doPrint(); // Interrupt main() by making a function call to doPrint()
    doPrint(); // Interrupt main() by making a function call to doPrint()
    std::cout << "Ending main()\n";

    return 0;
}
#+END_SRC
#+RESULTS:
: Starting main()
: In doPrint()
: In doPrint()
: Ending main()
*** functions calling functions calling functions
#+BEGIN_SRC cpp
#include <iostream>

void doB() {
    std::cout << "In doB()\n";
}

void doA() {
    std::cout << "Starting doA()\n";
    doB();
    std::cout << "Ending doA()\n";
}

int main() {
    std::cout << "Starting main()\n";
    doA();
    std::cout << "Ending main()\n";
    return 0;
}
#+END_SRC
#+RESULTS:
: Starting main()
: Starting doA()
: In doB()
: Ending doA()
: Ending main()
